### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_storage_encryption_scope.rejected_logins_logs will be created
  + resource "azurerm_storage_encryption_scope" "rejected_logins_logs" {
      + id                 = (known after apply)
      + key_vault_key_id   = (known after apply)
      + name               = "rejectedloginslogs01"
      + source             = "Microsoft.KeyVault"
      + storage_account_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-audit-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnauthauditst01"
    }

  # module.function_profile.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-profile-func-02/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"                             = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                              = "Terraform"
            "Environment"                            = "Prod"
            "ManagementTeam"                         = "IO Auth&Identity"
            "ModuleName"                             = "azure_function_app"
            "ModuleSource"                           = "DX"
            "ModuleVersion"                          = "1.0.1"
            "Owner"                                  = "IO"
            "Source"                                 = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (32 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (33 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.key_vaults.azurerm_key_vault_key.rejected_logins_01 will be created
  + resource "azurerm_key_vault_key" "rejected_logins_01" {
      + curve                   = (known after apply)
      + e                       = (known after apply)
      + id                      = (known after apply)
      + key_opts                = [
          + "decrypt",
          + "encrypt",
          + "sign",
          + "unwrapKey",
          + "verify",
          + "wrapKey",
        ]
      + key_size                = 4096
      + key_type                = "RSA"
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-auth-kv-01"
      + n                       = (known after apply)
      + name                    = "rejected-logins-logs-storage-01"
      + public_key_openssh      = (known after apply)
      + public_key_pem          = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Auth&Identity"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
      + x                       = (known after apply)
      + y                       = (known after apply)
    }

  # module.storage_account_audit_services.azurerm_storage_container.containers["rejected-login-logs-01"] will be created
  + resource "azurerm_storage_container" "containers" {
      + container_access_type             = "private"
      + default_encryption_scope          = "rejectedloginslogs01"
      + encryption_scope_override_enabled = false
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = {
          + "costcenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "createdby"      = "Terraform"
          + "environment"    = "Prod"
          + "managementteam" = "IO Auth&Identity"
          + "owner"          = "IO"
          + "source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      + name                              = "rejected-login-logs-01"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-audit-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnauthauditst01"
    }

  # module.storage_account_audit_services.azurerm_storage_container_immutability_policy.immutability_policies["rejected-login-logs-01"] will be created
  + resource "azurerm_storage_container_immutability_policy" "immutability_policies" {
      + id                                    = (known after apply)
      + immutability_period_in_days           = 731
      + locked                                = false
      + protected_append_writes_all_enabled   = false
      + protected_append_writes_enabled       = false
      + storage_container_resource_manager_id = (known after apply)
    }

Plan: 4 to add, 1 to change, 0 to destroy.
```

</details>
